package classs;

public class InfoTeam extends Teams {
    private String CharlotteHornets = "تیم شارلوت هورنتز (Charlotte Hornets) تیم یسکت آمریکایی است که در شهر شارلوت ایالت کارولینای شمالی واقع شده است.این تیم در تقسیم بندی NBA در منطقه جنوب شرق کنفرانس شرق قرار دارد و بازی های خانگی خود را در سالن Time Warner Cable Arena که در مرکز شهر شارلوت قرار دارد،برگزار می کند جردن،ستاره سابق بسکتبال NBA از سال ۲۰۱۰ مالک این باشگاه است.\n" +
            "تیم هورنتز در سال ۱۹۸۸ تاسیس شد و پس از فصل ۲۰۰۱-۰۲ به نیو اورلئانز منتقل شد و به نیو اورلئانز هورنتز تغییر نام داد. در سال ۲۰۰۴ تیم دیگری با نام شارلوت بابکتز در شهر شارلوت تاسیس شد؛ این تیم پس از ۱۰ فصل، در سال ۲۰۱۴ نام خود را به شارلوت هورنتز تغییر داد. آنها علاوه بر تغییر نام، تاریخچه و رکوردهایی را که در فاصله\u200Cی سال های ۱۹۸۸ تا ۲۰۰۲ ثبت کرده بودند و پیش از این در اختیار نیو اورلئانز پلیکانز بود، بازپس گرفتند. این تیم در فصل ۲۰۰۹-۲۰۱۰ با درخشش جرالد والاس به مرحله پلی آف لیگ NBA راه یافت که البته در همان مرحله اول توسط اورلاندو مجیک حذف شد.یکی از معدود افتخارات این تیم نیز حضور جرالد والاس از این تیم در آخر هفته آل استار ۲۰۱۰ بود.\n" +
            "شارلوت فصل ۲۰۱۱-۲۰۱۲ با ثبت رکورد ۷ برد و ۵۹ باخت،ضعیف ترین عملکرد یک تیم در تاریخ NBA را ثبت کرد.";

    private String TorontoRaptors="تیم تورنتو رپترز (Toronto Raptors) تیمکانادایی است که در شهر تورنتو ایالت اونتاریو کشور کانادا واقع شده است..این تیم در تقسیم بندیدر منطقه Atlantic کنفرانس شرق قرار دارد.این تیم در سال ۱۹۹۵ به همراه تیم ونکوور گریزلیز و در جریان توسعه لیگ بسکتبال NBA در کشور کانادا تاسیس شد.هنگامی که تیم گریزلیز در سال ۲۰۰۱ به شهر ممفیس ایالت تنسی آمریکا نقل مکان کرد،تیم رپترز به تنها تیم کانادایی لیگ NBA تبدیل شد.\n" +
            "مانند اکثر تیم های NBA که به منظور توسعه لیگ ایجاد شدند،تیم رپترز نیز در سال های اولیه تاسیسش تلاش زیادی برای مطرح شدن کرد.اما پس از جذب وینس کارتر در درفت سال ۱۹۹۸،این تیم توانست با حضور در پلی آف NBA در سال های ۲۰۰۰،۲۰۰۱ و ۲۰۰۲ نامش را در رکوردهای NBA ثبت کند.این تیم در سال ۲۰۰۱ با رهبری وینس کارتر توانست ۴۷ پیروزی در رقابت های فصل عادی کسب کند و به پلی آف راه یافت.در مرحله پلی آف نیز توانست تا نیمه نهایی کنفرانس شرق بالا بیاید..پس از رفتن کارتر از این تیم،کریس باش به عنوان رهبر این تیم ظهور کرد،اما رپترز همچنان نتایج قابل توجهی کسب نمی کرد . رپترز در فصل ۲۰۰۹-۲۰۱۰ کریس باش که آخرین سال قراردادش با این تیم را پشت سر می گذاشت،را در تیم حفظ کرد.با این حال همزمان با مصدومیت های کریس باش بعد از شکستگی که برای این بازیکن در مسابقه آل استار پیش آمد،تیم رپترز در پایین جدول رده بندی جای گرفت و نتوانست به پلی آف صعود کند.با پیوستن کریس باش بهمیامیدر جولای ۲۰۱۰،عصر جدید رپترز با حضور ستاره ی جدیدی به نام آندری بارنیانی آغاز شد.\n" +
            "افتخارت:یک بار حضور در مرحله نیمه نهایی کنفرانس شرق";


    private String IndianaPacers ="تیم ایندیانا پیسرز (Indiana Pacers) تیم بسکتبال آمریکایی است که در شهر ایندیاناپلیس ایالت ایندیانا واقع شده است.این تیم در تقسیم بندی NBA در منطقه مرکزی کنفرانس شرق قرار دارد و بازی های خانگی اش را در سالن Bankers Life Fieldhouse برگزار می کند.این سالن هم چنین توسط تیم Indiana Fever که در لیگ زنان ان بی ای بازی می کند،مورد استفاده قرار می گیرد.\n" +
            "تیم پیسرز بازی های خود را در سال ۱۹۶۷ در لیگ ABA آغاز کرد و توانست ۳ عنوان قهرمانی در این لیگ کسب کند.پیسرز در سال ۱۹۷۶ از لیگ ABA جدا شد و به NBA پیوست.فشارهای مالی پس از انتقال باعث از بین رفتن تسلط پیسرز بر لیگ شد و این آغاز مبارزات مجموعه\u200Cی تیم پیسرز در دهه های بعدی شد.جذب رجی میلر در سال ۱۹۸۷ نقطه ی شروع تجدید حیات این تیم برای بازگشت به روزهای خوب خود بود که با رسیدن این تیم به فینال NBA در سال ۲۰۰۰ به نقطه ی اوج خود رسید.البته ایندیانا در فینال ۲۰۰۰ ان بی ای با نتیجه ۴ بر ۲ مغلوب لس آنجلس لیکرز شد.\n" +
            "این تیم در سال ۲۰۰۷ نتوانست در مرحله پلی آف NBA حاضر شود که این اتفاق از سال ۱۹۹۷ بی سابقه بود.پیسرز سرانجام در سال ۲۰۱۱ دوباره توانست به مرحله پلی آف لیگ برسد.\n" +
            "لری برد،بازیکن افسانه ای NBA نیز سال ۹۷ تا ۲۰۰۰ سرمربیگری این تیم را به عهده داشته است.از بازیکنان بزرگ این تیم می توان به رجی میلر و مل دنیلز اشاره کرد که هر دو در سال ۲۰۱۲ وارد تالار مشاهیر NBA شده اند.";

    public String AtlantaHawks ="تیم آتلانتا هاوکس (Atlanta Hawks) تیم بسکتبال آمریکایی است که در شهر آتلانتا ایالت جرجیا واقع شده است.این تیم در تقسیم بندی NBA در منطقه جنوب شرق کنفرانس شرق قرار دارد.بازی های خانگی تیم بسکتبال Atlanta Hawks در ورزشگاه فیلیپس آرنا برگزار می شود که در جنوب شهر آتلانتا قرار دارد.\n" +
            "این تیم در سال ۱۹۴۶ و با نام Buffalo Bisons تاسیس شد و جزو تیم های لیگ NBL بود.تیم بوفالو بیسونز پس از انجام ۱۳ بازی در اولین فصل حضور خود در لیگ،به شهر مولین ایالت ایلینویز منتقل شد و به Tri-City Blackhawks تغییر نام داد.در سال ۱۹۴۹ و تشکیل لیگ NBA این تیم نیز به آن پیوست.در سال ۱۹۵۱ این تیم شاهد جا به جایی دیگری بود و این بار به شهر میلواکی ایالت ویسکانسین نقل مکان کرد و نامش را به هاوکس تغییر داد.این تیم ۳ سال پس از آنکه در سال ۱۹۵۵ به شهر سنت لوییس ایالت میسوری آمد توانست اولین و تنها قهرمانی خود در لیگ NBA را در سال ۱۹۵۸ کسب کند.سرانجام و در سال ۱۹۶۸ این تیم به شهر آتلانتا منتقل شد و تا امروز نیز در این شهر مانده است.\n" +
            "آتلانتا هاوکس ۵۷ سال است که فاتح جام قهرمانی NBA نشده است و در این زمینه پس از تیم ساکرامنتو کینگز در رده دوم قرار دارد.(ساکرامننتو از سال ۱۹۵۱ تاکنون قهرمان ان بی ای نشده است.)\n" +
            "پس از انتقال این تیم به آتلانتا،آنها ۴۸ سال نتوانستند از دور دوم مرحله حذفی NBA بالاتر بیایند تا اینکه در سال ۲۰۱۵ موفق به انجام این کار شدند.به عقیده بسیاری از کارشناسان علت نتایج ضعیف این تیم از سال ۱۹۸۴ تاکنون بد عمل کردن این تیم در یارکشی های NBA است.\n" +
            "از بازیکنان شاخص باشگاه آتلانتا هاوکس می توان به موزس مالون و پیت ماراویچ اشاره کرد که البته در سال های دور در این تیم حضور داشتند.";

    public String WashingtonWizards ="تیم واشنگتن ویزاردز (Washington Wizards) تیم بسکتبال آمریکایی است که در شهر واشنگتن واقع شده است.تیم بسکتبال واشنگتن ویزاردز در تقسیم بندی NBA در منطقه جنوب شرق کنفرانس شرق قرار دارد.بازی های خانگی این تیم در ورزشگاه ورایزون سنتر برگزار می شود که در محله چینی ها در همسایگی شهر واشنگتن قرار دارد.\n" +
            "تیم Washington Wizards در سال ۱۹۶۱ و با نام شیکاگو پکرز تاسیس شده است که بیشترین تغییر نام را در تاریخ خود ثبت کرده است.تنها قهرمانی این تیم در سال ۱۹۷۸ و با حضور ستارگانی چون Elvin Hayes و Charles Johnson به دست آمد.این تیم که در آن سال با نام واشنگتن بولتز شناخته می شد،در فینال با نتیجه ۴ بر ۳ تیم سیاتل سوپر سونیکس را مغلوب کرد و قهرمان شد.مایکل جردن،اسطوره بسکتبال آمریکا و جهان نیز از سال ۲۰۰۱ تا ۲۰۰۳ عضو این تیم بوده است.\n" +
            "ویزاردز در دهه ۸۰ میلادی جزو تیم های قدرتمند ان بی ای بود؛اما در سال های اخیر نتوانسته عنوان قابل توجهی در NBA کسب کند.";

    public String Philadelphia76ers ="تیم فیلادلفیا سونی سیکسرز (Philadelphia 76ers) تیم بسکتبال آمریکایی است که در شهر فیلادلفیا ایالت پنسیلوانیا واقع شده است. این تیم در منطقه آتلانتیک کنفرانس شرق NBA قرار دارد. نام قبلی این تیم Syracuse Nationals بود که به عنوان یکی از تیم های قدیمی NBA شناخته می شد. پس از انتقال این تیم به شهر فیلادلفیا در سال ۱۹۶۳،مسابقه ای برای انتخاب نام جدید تیم برگزار شد که نام “۷۶ers” که شخصی به نام “Walter Stalberg” آن را پیشنهاد داده بود انتخاب شد. این نام برای ادای احترام به مردانی که کشور ایالات متحده را در سال ۱۷۷۶ تاسیس کردند، انتخاب شد.\n" +
            "تیم Philadelphia دارای تاریخچه ای غنی است. تعداد زیادی از بزرگترین بازیکنان NBA نظیر ویلت چمبرلین، جولیوس اروینگ، موزس مالون، چارلز بارکلی و آلن آیورسن در این تیم بازی کرده اند. این تیم سه بار قهرمان لیگ NBA شده است که اولین بار آن در سال ۱۹۵۵ به دست آمده است. دومین قهرمانی این تیم در فصل ۶۶-۶۷ و با رهبری سنتر پر آوازه ی این تیم یعنی Wilt Chamberlain به دست آمد. آخرین قهرمانی این تیم نیز به فصل ۸۲-۸۳ برمی گردد که بازیکنانی مثل اروینگ و مالون در این تیم بازی می کردند. پس از سال ۸۳ تیم فیلادلفیا سیکسرز تنها یکبار در سال ۲۰۰۱ با حضور آلن آیورسن به فینال ان بی ای رسید که در این فینال نیز با نتیجه ۴ بر ۱ مغلوب لس آنجلس لیکرز شد.";

    public String getCharlotteHornets() {
        return CharlotteHornets;
    }

    public void setCharlotteHornets(String charlotteHornets) {
        CharlotteHornets = charlotteHornets;
    }

    public String getTorontoRaptors() {
        return TorontoRaptors;
    }

    public void setTorontoRaptors(String torontoRaptors) {
        TorontoRaptors = torontoRaptors;
    }

    public String getIndianaPacers() {
        return IndianaPacers;
    }

    public void setIndianaPacers(String indianaPacers) {
        IndianaPacers = indianaPacers;
    }

    public String getAtlantaHawks() {
        return AtlantaHawks;
    }

    public void setAtlantaHawks(String atlantaHawks) {
        AtlantaHawks = atlantaHawks;
    }

    public String getWashingtonWizards() {
        return WashingtonWizards;
    }

    public void setWashingtonWizards(String washingtonWizards) {
        WashingtonWizards = washingtonWizards;
    }

    public String getPhiladelphia76ers() {
        return Philadelphia76ers;
    }

    public void setPhiladelphia76ers(String philadelphia76ers) {
        Philadelphia76ers = philadelphia76ers;
    }

    public String getChicagoBulls() {
        return ChicagoBulls;
    }

    public void setChicagoBulls(String chicagoBulls) {
        ChicagoBulls = chicagoBulls;
    }

    public String ChicagoBulls ="تیم شیکاگو بولز (ChicagoBulls) تیم حرفه ای بسکتبال NBA است که در شهر شیکاگو ایالت ایلینویز قرار دارد و در تقسیم بندی تیم های NBA در منطقه مرکزی کنفرانس شرق قرار دارد.بولز در سال ۱۹۶۶ تاسیس شده است و بازی های خانگی خود را در ورزشگاه یونایتد سنتر (United Center) انجام می دهد. این تیم به خاطر قهرمانی های پی در پی در دهه ۹۰ در NBA شناخته شده است. شیکاگو بولز در سالهای دهه ی ۹۰ موفق به کسب ۶ قهرمانی شده است. تمام مقام های قهرمانی این تیم با رهبری مایکل جردن، اسکاتی پیپن و سرمربی گری فیل جکسون به دست آمده است. در سه قهرمانی متوالی اول این تیم بازیکنانی مثل Bill Cartwright,Horace Grant,John Paxson و B.J. Armstrong در ترکیب تیم حضور داشتند و در قهرمانی های سه گانه دوم نیز بازیکنان بزرگی چون Luc Longley, Steve Kerr, Ron Harper, Toni Kukoč و Dennis Rodman در این تیم بازی می کردند.\n" +
            "شیکاگو بولز در فصل ۹۵-۹۶ موفق شد ۷۲ بازی از ۸۲ بازی فصل عادی را با پیروزی پشت سر بگذارد و با ثبت این رکورد، در تاریخ NBA تنها تیمی باشد که در یک فصل در ۷۰ مسابقه یا بیشتر پیروز بوده است. بازی های تماشایی این تیم در دهه ۹۰ به محبوبیت لیگ ان بی ای در سراسر جهان کمک کرد. قهرمانی این تیم در سال ۹۸ که آخرین قهرمانی آنها بود، پربیننده ترین بازی های فینال در تاریخ NBA است.این تیم در ۶ بار حضور خود در فینال NBA هیچگاه بازنده نبوده است. این تیم پس از تیم های بوستون و لیکلز، با ۶ قهرمانی سومین تیم پرافتخار ان بی ای است.\n" +
            "طبق گزارش موسسه فوربز در سال ۲۰۱۳، ارزش تقریبی این باشگاه ۱ میلیارد دلار است که سومین تیم با ارزش لیگ NBA محسوب می شود. همچنین درآمد این تیم در سال ۲۰۱۳ حدود ۵۲٫۲ میلیون دلار تخمین زده شده است.\n" +
            "مایکل جردن،اسطوره NBA و درک رز در زمان عضویت در شیکاگو بولز در مجموع ۶ بار برنده جایزه MVP شده اند که ۵ بار آن متعلق به Michael Jordan است.\n";

}

