package com.example.myapplication22;

public class ClassThery extends Teams{
    private String TorontoRaptors="تیم تورنتو رپترز (Toronto Raptors) تیمکانادایی است که در شهر تورنتو ایالت اونتاریو کشور کانادا واقع شده است..این تیم در تقسیم بندیدر منطقه Atlantic کنفرانس شرق قرار دارد.این تیم در سال ۱۹۹۵ به همراه تیم ونکوور گریزلیز و در جریان توسعه لیگ بسکتبال NBA در کشور کانادا تاسیس شد.هنگامی که تیم گریزلیز در سال ۲۰۰۱ به شهر ممفیس ایالت تنسی آمریکا نقل مکان کرد،تیم رپترز به تنها تیم کانادایی لیگ NBA تبدیل شد.\n" +
            "مانند اکثر تیم های NBA که به منظور توسعه لیگ ایجاد شدند،تیم رپترز نیز در سال های اولیه تاسیسش تلاش زیادی برای مطرح شدن کرد.اما پس از جذب وینس کارتر در درفت سال ۱۹۹۸،این تیم توانست با حضور در پلی آف NBA در سال های ۲۰۰۰،۲۰۰۱ و ۲۰۰۲ نامش را در رکوردهای NBA ثبت کند.این تیم در سال ۲۰۰۱ با رهبری وینس کارتر توانست ۴۷ پیروزی در رقابت های فصل عادی کسب کند و به پلی آف راه یافت.در مرحله پلی آف نیز توانست تا نیمه نهایی کنفرانس شرق بالا بیاید..پس از رفتن کارتر از این تیم،کریس باش به عنوان رهبر این تیم ظهور کرد،اما رپترز همچنان نتایج قابل توجهی کسب نمی کرد . رپترز در فصل ۲۰۰۹-۲۰۱۰ کریس باش که آخرین سال قراردادش با این تیم را پشت سر می گذاشت،را در تیم حفظ کرد.با این حال همزمان با مصدومیت های کریس باش بعد از شکستگی که برای این بازیکن در مسابقه آل استار پیش آمد،تیم رپترز در پایین جدول رده بندی جای گرفت و نتوانست به پلی آف صعود کند.با پیوستن کریس باش بهمیامیدر جولای ۲۰۱۰،عصر جدید رپترز با حضور ستاره ی جدیدی به نام آندری بارنیانی آغاز شد.\n" +
            "افتخارت:یک بار حضور در مرحله نیمه نهایی کنفرانس شرق";

    public String getTorontoRaptors() {
        return TorontoRaptors;
    }

    public void setTorontoRaptors(String torontoRaptors) {
        TorontoRaptors = torontoRaptors;
    }
}
