package com.example.myapplication22;

public class ClassTow extends Teams{
    private String BrooklynNets = "تیم بروکلین نتز (Brooklyn Nets) تیم بسکتبال آمریکایی است که در منطقه بروکلین نیویورک واقع شده است.این تیم در تقسیم بندی تیم های NBA در منطقه آتلانتیک (اقیانوس اطلس) کنفرانس شرق قرار دارد.تیم نتز به همراه ،دو تیم شهر نیویورک در لیگ NBA هستند.باشگاه بسکتبال نتز در سال ۱۹۶۷ با نام New Jersey Americans تاسیس شد و در ایالت نیوجرسی قرار داشت.همانند بسیاری از تیم های NBA،این تیم نیز جابجایی های زیادی در شهر های مختلف آمریکا داشته است.اعضای این تیم در سال های اولیه جابه جایی زیادی داشتند؛در سال ۱۹۶۸ به Long Island مهاجرت کردند و در رقابت های مختلفی با نام نیویورک نتز شرکت کردند.پیش از ادغام لیگ های بسکتبال ABA و NBA در سال ۱۹۷۶،این تیم توانست دو قهرمانی لیگ ABA را به دست آورد.\n" +
            "نتز در سال ۱۹۷۷ به شهر نیوجرسی بازگشت و نامش را به نیوجرسی نتز تغییر داد.این تیم در مدت حضورش در ایالت نیوجرسی شاهد شکست های و پیروزی های مختلفی بود.نقطه اوج پیروزی های این تیم در ایالت نیوجرسی،راهیابی به فینال NBA در دو فصل متوالی ۲۰۰۱-۲۰۰۲ و ۲۰۰۲-۲۰۰۳ بود.\n" +
            "تیم نتز پس از ۳۵ سال بازی در نیوجرسی در سال ۲۰۱۲ دوباره به نیویورک بازگشت تا بازی های خانگی خود را در ورزشگاه جدیدش با نام بارکلیز سنتر برگزار کند.نام این تیم نیز پس از این جا به جایی از نیوجرسی نتز به بروکلین نتز تغییر کرد.\n" +
            "از بازیکنان بزرگ این تیم می توان به جولیوس اروینگ و Dražen Petrović اشاره کرد.\n" +
            "افتخارات: 2 قهرمانی ABA، 2 قهرمانی کنفرانس شرق";

    public String getBrooklynNets() {
        return BrooklynNets;
    }

    public void setBrooklynNets(String brooklynNets) {
        BrooklynNets = brooklynNets;
    }
}
