package com.example.myapplication22;

public class ClassFour extends Teams {
    private String CharlotteHornets = "تیم شارلوت هورنتز (Charlotte Hornets) تیم یسکت آمریکایی است که در شهر شارلوت ایالت کارولینای شمالی واقع شده است.این تیم در تقسیم بندی NBA در منطقه جنوب شرق کنفرانس شرق قرار دارد و بازی های خانگی خود را در سالن Time Warner Cable Arena که در مرکز شهر شارلوت قرار دارد،برگزار می کند جردن،ستاره سابق بسکتبال NBA از سال ۲۰۱۰ مالک این باشگاه است.\n" +
            "تیم هورنتز در سال ۱۹۸۸ تاسیس شد و پس از فصل ۲۰۰۱-۰۲ به نیو اورلئانز منتقل شد و به نیو اورلئانز هورنتز تغییر نام داد. در سال ۲۰۰۴ تیم دیگری با نام شارلوت بابکتز در شهر شارلوت تاسیس شد؛ این تیم پس از ۱۰ فصل، در سال ۲۰۱۴ نام خود را به شارلوت هورنتز تغییر داد. آنها علاوه بر تغییر نام، تاریخچه و رکوردهایی را که در فاصله\u200Cی سال های ۱۹۸۸ تا ۲۰۰۲ ثبت کرده بودند و پیش از این در اختیار نیو اورلئانز پلیکانز بود، بازپس گرفتند. این تیم در فصل ۲۰۰۹-۲۰۱۰ با درخشش جرالد والاس به مرحله پلی آف لیگ NBA راه یافت که البته در همان مرحله اول توسط اورلاندو مجیک حذف شد.یکی از معدود افتخارات این تیم نیز حضور جرالد والاس از این تیم در آخر هفته آل استار ۲۰۱۰ بود.\n" +
            "شارلوت فصل ۲۰۱۱-۲۰۱۲ با ثبت رکورد ۷ برد و ۵۹ باخت،ضعیف ترین عملکرد یک تیم در تاریخ NBA را ثبت کرد.";

    public String getCharlotteHornets() {
        return CharlotteHornets;
    }

    public void setCharlotteHornets(String charlotteHornets) {
        CharlotteHornets = charlotteHornets;
    }
}
