package com.example.myapplication22;

public class ClassOne extends Teams{
    private String CharlotteHornets = "تیم بوستون سلتیکس (Boston Celtics) تیم حرفه ای بسکتبال NBA است که در شهر بوستون ایالت ماساچوست قرار دارد. این تیم در منطقه آتلانتیک کنفرانس شرق NBA قرار داردر سال ۱۹۴۶ تاسیس شده است.بازی های خانگی تیم بسکتبال بوستون سلتیکس در تی دی گاردن (TD Garden) برگزار می شود که تیم هاکی Boston Bruins نیز از آن استفاده می کند.این تیم با ۱۷ قهرمانی در ان بی ای پر افتخارترین تیم NBA است.\n" +
            "در فاصله سال های ۱۹۵۷ تا ۶۹ و در عرض ۱۳ سال،بوستون موفق به کسب ۱۱ قهرمانی شد که هشت قهرمانی آن از سال ۵۹ تا ۶۶ به صورت متوالی به دست آمد. این تعداد قهرمانی پشت سر هم در میان تیم های حرفه ای ورزشی آمریکای شمالی رکورد محسوب می شود. باشگاه سلتیکس در اواخر دهه پنجاه و اواسط دهه ۸۰ میلادی، با حضور مفاخری چون لری برد، باب کازی، جان هاولیچک، و مربی افسانه ای Red Auerbach بر لیگ حکمرانی می کرد. Red در طول حضورش در سلتیکس رکورد ۷۹۵ برد و ۳۹۷ باخت را به جا گذاشت و موفق به کسب ۱۶ قهرمانی با این تیم شد. قبل از بازنشستگی لری برد، رابرت پریش و کوین مک هیل ملقب به “Big Three”، اورباخ مربی سلتیکس،Len Bias را در درفت جذب کرد اما این بازیکن دو روز پس از درفت شدن توسط سلتیکس، درگذشت. بعدها تراژدی دیگری برای بوستون به وقوع پیوست و ستاره این تیم رجی لوییس، در اثر یک حمله قلبی درگذشت.\n" +
            "سلتیکس در فصل ۲۰۰۷-۰۸ و با پیوستن کوین گارنت و ری آلن به پاول پیرس، بار دیگر قدرت گرفت. با رهبری این سه بازیکن بوستون هفدهمین قهرمانی خود را در سال ۲۰۰۸ به دست آورد و در سال ۲۰۱۰ نیز قهرمان کنفرانس شد. تیم های بوستون لس انجلس لیتلز تا به حال ۱۲ بار در فینال NBA با هم روبرو شده اند که آخرین رویارویی این تیم ها در سال ۲۰۱۰ بود. بوستون تا به حال ۹ پیروزی مقابل حریفش در فینال کسب کرده است. بوستون در سال ۲۰۱۰ و با ظهور ستاره ای به نام راژان راندو در پست گارد راس، بار دیگر قدرت گرفت. چهار بازیکن بوستون یعنی باب کازی، بیل راسل، دیو کونز و لری برد در مجموع ۱۰ بار برنده جایزه MVP ان بی ای شده اند که در NBA یک رکورد محسوب می شود.\n" +
            "افتخارت:17 قهرمانی NBA ، 21 قهرمانی در کنفرانس شرق";

    public String getCharlotteHornets() {
        return CharlotteHornets;
    }

    public void setCharlotteHornets(String charlotteHornets) {
        CharlotteHornets = charlotteHornets;
    }
}
